#include<stdio.h>
void main(void)
{
    printf("%10.5f\n ", 12.234657);
    printf("%-20s\t","Это текст");
    printf ("Остаток от деления %d на %d равен %d\n ",7, 5, 7%5);
    printf ("Остаток от деления %d на %d равен %d\n ",5, 2, 5%2);
    printf ("%d умножить на %d равено %d\n ",2000, 4, 2000*4);
    printf ("%g разделить %e равно %f\n ",5., 2., 5./2);

    int N, K;
    N=19;
    K=10;
    printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
    printf("Идет %d минута суток\n", N*60);
    printf("До полуночи осталось %d часов и %d минут\n", 24-N, 60-K);
    printf("С 8.00 прошло %d секунд\n", ((N-8)*3600+K*60));
    printf("Текущий час = %d/24 суток и текущая минута = %d/60 часа\n", N, K);


    //вариант 10 n=2 k=3 m=7
    
    float n=2, z=333;
    printf("   %g\n", n);
    printf("   %g\n", z);
    printf("  ---------\n");
    printf("+%-3.7f\n", n/z);


    // в две строки

    
    printf("   %g разделить на %g\n", n, z);
    printf("+%-3.7f\n", n/z);

    

}